<a href="https://colab.research.google.com/github/wilmerod/Notebooks-Curso-Big-Data/blob/main/Ejercicios_Pandas_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

El fichero train.csv contiene información sobre los pasajeros del Titanic. 

Descargue el fichero train.csv en su ordenador desde
https://www.kaggle.com/c/titanic/data?select=train.csv

Suba el fichero train.csv a la carpeta sample_data de Google Colab

1. Generar un DataFrame con los datos del fichero.

In [3]:
import pandas as pd

# Generar un DataFrame con los datos del fichero.
titanic = pd.read_csv('sample_data/train.csv', index_col=0)

print(titanic)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[891 rows x 11 columns]

2. Mostrar por pantalla las dimensiones del DataFrame y el número de datos que contiene

In [40]:
print(titanic.shape)
print(titanic.size)

(891, 11)
9801

3. Mostrar los nombres de sus columnas y filas

In [28]:
print("Nombre de las columnas:")
for x in titanic.columns:
  print(x)

Nombre de las columnas:
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [ ]:
# Nombre de las filas

In [43]:
print(titanic.columns)
print(titanic.index)

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
           dtype='int64', name='PassengerId', length=891)

4. Mostrar los tipos de datos del DataFrame

In [44]:
titanic.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [45]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

5. Mostrar las 10 primeras filas y las 10 últimas filas.

In [46]:
print(titanic.head(10))
print(titanic.tail(10))

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]
             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
882                 0       3  ...   NaN        S
883                 0       3  ...   NaN        S
884                 0       2  ...   NaN        S
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[10 rows x 11 columns]

6. Mostrar por pantalla los datos del pasajero con identificador 148

In [50]:
pasajero148 = titanic.iloc[148-1]
print(pasajero148)
pasajero148 = titanic.loc[148]
print(pasajero148)

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object
Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

7. Mostrar cuántos pasajeros viajaban en el Titanic

In [51]:
print(titanic.shape[0])
print(len(titanic))

891
891

8. Mostrar cuántos pasajeros sobrevivieron al naufragio

In [56]:
supervivientes = len(titanic[ titanic['Survived'] == 1 ] )
print(supervivientes )

print(titanic['Survived'].sum())

342
342

9. Mostrar la suma de las tarifas (columna Fare)

In [58]:
print (sum(titanic['Fare'] ) )

print (titanic['Fare'].sum() )

SyntaxError: ignored

10. Mostrar la edad media de los pasajeros del Titanic

In [63]:
titanic['Age'].mean()

29.69911764705882

11. Mostrar la edad media de los pasajeros según su género

In [64]:
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

12. Mostrar las columnas de nombre y edad de los pasajeros

In [67]:
titanic[['Name','Age']]

                                                          Name   Age
PassengerId
1                                      Braund, Mr. Owen Harris  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3                                       Heikkinen, Miss. Laina  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5                                     Allen, Mr. William Henry  35.0
...                                                        ...   ...
887                                      Montvila, Rev. Juozas  27.0
888                               Graham, Miss. Margaret Edith  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"   NaN
890                                      Behr, Mr. Karl Howell  26.0
891                                        Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

13. Mostrar los pasajeros mayores de 65 años

In [69]:
titanic[titanic['Age'] > 65 ]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
34                  0       2  ...   NaN        S
97                  0       1  ...    A5        C
117                 0       3  ...   NaN        Q
494                 0       1  ...   NaN        C
631                 1       1  ...   A23        S
673                 0       2  ...   NaN        S
746                 0       1  ...   B22        S
852                 0       3  ...   NaN        S

[8 rows x 11 columns]

14. Mostrar por pantalla las filas pares del DataFrame.

15. Mostrar los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

16. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron

17. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase

18. Eliminar del DataFrame los pasajeros con edad desconocida.

19. Mostrar la edad media de las mujeres que viajaban en cada clase.

20. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

21. Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

22. Añadir una columna con la longitud de caracteres del nombre del pasajero